#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
    - mode                     = "LastWriterWins" -> null
        }

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          ~ composite_index {
              ~ index {
                  ~ order = "ascending" -> "Ascending"
                    # (1 unchanged attribute hidden)
                }
              ~ index {
                  ~ order = "ascending" -> "Ascending"
                    # (1 unchanged attribute hidden)
                }
              ~ index {
                  ~ order = "ascending" -> "Ascending"
                    # (1 unchanged attribute hidden)
                }
              ~ index {
                  ~ order = "ascending" -> "Ascending"
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.leases must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "leases" {
      ~ account_name          = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      + default_ttl           = (known after apply)
      ~ id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/leases" -> (known after apply)
        name                  = "leases"
      ~ throughput            = 100 -> (known after apply)
        # (4 unchanged attributes hidden)

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.subscription must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "subscription" {
      ~ account_name          = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      + default_ttl           = (known after apply)
      ~ id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/subscription" -> (known after apply)
        name                  = "subscription"
      ~ throughput            = 100 -> (known after apply)
        # (4 unchanged attributes hidden)

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

      - indexing_policy {
          - indexing_mode = "consistent" -> null

          - included_path {
              - path = "/*" -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.subscription_history must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "subscription_history" {
      ~ account_name          = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      + default_ttl           = (known after apply)
      ~ id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/subscription-history" -> (known after apply)
        name                  = "subscription-history"
      ~ throughput            = 100 -> (known after apply)
        # (4 unchanged attributes hidden)

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

      ~ indexing_policy {
            # (1 unchanged attribute hidden)

          ~ composite_index {
              ~ index {
                  ~ order = "ascending" -> "Ascending"
                    # (1 unchanged attribute hidden)
                }
              ~ index {
                  ~ order = "descending" -> "Descending"
                    # (1 unchanged attribute hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_container.trials must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "trials" {
      ~ account_name          = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      + default_ttl           = (known after apply)
      ~ id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db/containers/trials" -> (known after apply)
        name                  = "trials"
      ~ throughput            = 100 -> (known after apply)
        # (4 unchanged attributes hidden)

      - conflict_resolution_policy {
          - conflict_resolution_path = "/_ts" -> null
          - mode                     = "LastWriterWins" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_async_fn_staging_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_async_fn_staging_to_cosmos_db" {
      ~ account_name        = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/16697b9e-7623-1ce4-d4e1-e0dda801e29f" -> (known after apply)
      ~ name                = "16697b9e-7623-1ce4-d4e1-e0dda801e29f" -> (known after apply)
      ~ role_definition_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
      ~ scope               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/dbs/db" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_async_fn_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_async_fn_to_cosmos_db" {
      ~ account_name        = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/61b1db9c-c41d-4dba-e880-286a3a1428ed" -> (known after apply)
      ~ name                = "61b1db9c-c41d-4dba-e880-286a3a1428ed" -> (known after apply)
      ~ role_definition_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
      ~ scope               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/dbs/db" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_fn_staging_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_fn_staging_to_cosmos_db" {
      ~ account_name        = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/6bd936bd-c108-2cab-5621-23064257afb6" -> (known after apply)
      ~ name                = "6bd936bd-c108-2cab-5621-23064257afb6" -> (known after apply)
      ~ role_definition_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
      ~ scope               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/dbs/db" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_cosmosdb_sql_role_assignment.subs_fn_to_cosmos_db must be replaced
-/+ resource "azurerm_cosmosdb_sql_role_assignment" "subs_fn_to_cosmos_db" {
      ~ account_name        = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleAssignments/85704e8c-4928-0dce-4e86-9cef3e7f6b7f" -> (known after apply)
      ~ name                = "85704e8c-4928-0dce-4e86-9cef3e7f6b7f" -> (known after apply)
      ~ role_definition_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
      ~ scope               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/dbs/db" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_monitor_metric_alert.cosmosdb_account_normalized_RU_consumption_exceeded must be replaced
-/+ resource "azurerm_monitor_metric_alert" "cosmosdb_account_normalized_RU_consumption_exceeded" {
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Insights/metricAlerts/[TS-TRIAL | ts-p-itn-trial-account-01] Normalized RU Consumption Exceeded" -> (known after apply)
      ~ name                     = "[TS-TRIAL | ts-p-itn-trial-account-01] Normalized RU Consumption Exceeded" -> "[TS-TRIAL | ts-p-itn-cosno-01] Normalized RU Consumption Exceeded" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

        # (1 unchanged block hidden)
    }

  # module.commons.azurerm_private_endpoint.sql must be replaced
-/+ resource "azurerm_private_endpoint" "sql" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-private-endpoint-sql-01" -> (known after apply)
      ~ name                     = "ts-p-itn-private-endpoint-sql-01" -> "ts-p-itn-cosno-pep-02" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-private-endpoint-sql-01.nic.4730da2d-140b-4b13-9a85-541290aff5ab"
              - name = "ts-p-itn-private-endpoint-sql-01.nic.4730da2d-140b-4b13-9a85-541290aff5ab"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-private-endpoint-sql-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.7",
                        ]
                      - name         = "ts-p-itn-trial-account-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.8",
                        ]
                      - name         = "ts-p-itn-trial-account-01-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01-germanywestcentral.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.9",
                        ]
                      - name         = "ts-p-itn-trial-account-01-germanywestcentral"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                     = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-private-endpoint-sql-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-private-endpoint-sql" -> "ts-p-itn-cosno-psc-pep-02" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.30.2.7" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.commons.azurerm_private_endpoint.subscription_async_fn_staging must be replaced
-/+ resource "azurerm_private_endpoint" "subscription_async_fn_staging" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint" -> (known after apply)
      ~ name                     = "ts-p-itn-subscription-async-fn-staging-endpoint" -> "ts-p-itn-subscription-async-fn-staging-pep-01" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-subscription-async-fn-staging-endp.nic.4771add6-8bda-48be-9a52-b2717e6a8a05"
              - name = "ts-p-itn-subscription-async-fn-staging-endp.nic.4771add6-8bda-48be-9a52-b2717e6a8a05"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-subscription-async-fn-01-staging.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.19",
                        ]
                      - name         = "ts-p-itn-subscription-async-fn-01-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-subscription-async-fn-01-staging.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.19",
                        ]
                      - name         = "ts-p-itn-subscription-async-fn-01-staging.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-async-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-subscription-async-fn-staging-endpoint" -> "ts-p-itn-subscription-async-fn-staging-pep-01" # forces replacement
          ~ private_ip_address             = "10.30.2.19" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.commons.azurerm_private_endpoint.subscription_fn must be replaced
-/+ resource "azurerm_private_endpoint" "subscription_fn" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-endpoint" -> (known after apply)
      ~ name                     = "ts-p-itn-subscription-fn-endpoint" -> "ts-p-itn-subscription-fn-pep-01" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-subscription-fn-endpoint.nic.d2582e97-9b31-40f0-89e3-d87a223656ec"
              - name = "ts-p-itn-subscription-fn-endpoint.nic.d2582e97-9b31-40f0-89e3-d87a223656ec"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.16",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.16",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-subscription-fn-endpoint" -> "ts-p-itn-subscription-fn-pep-01" # forces replacement
          ~ private_ip_address             = "10.30.2.16" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.commons.azurerm_private_endpoint.subscription_fn_staging must be replaced
-/+ resource "azurerm_private_endpoint" "subscription_fn_staging" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-staging-endpoint" -> (known after apply)
      ~ name                     = "ts-p-itn-subscription-fn-staging-endpoint" -> "ts-p-itn-subscription-fn-staging-pep-01" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-subscription-fn-staging-endpoint.nic.3ec830b4-d05f-49dc-aeae-442abd06e11e"
              - name = "ts-p-itn-subscription-fn-staging-endpoint.nic.3ec830b4-d05f-49dc-aeae-442abd06e11e"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01-staging.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.17",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01-staging"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-subscription-fn-01-staging.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.30.2.17",
                        ]
                      - name         = "ts-p-itn-subscription-fn-01-staging.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-subscription-fn-staging-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-subscription-fn-staging-endpoint" -> "ts-p-itn-subscription-fn-staging-pep-01" # forces replacement
          ~ private_ip_address             = "10.30.2.17" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.commons.module.cosmosdb_account.azurerm_cosmosdb_account.this must be replaced
-/+ resource "azurerm_cosmosdb_account" "this" {
      ~ automatic_failover_enabled                   = true -> (known after apply)
      ~ connection_strings                           = (sensitive value)
      ~ create_mode                                  = "Default" -> (known after apply)
      ~ enable_multiple_write_locations              = false -> (known after apply)
      ~ endpoint                                     = "https://ts-p-itn-trial-account-01.documents.azure.com:443/" -> (known after apply)
      ~ free_tier_enabled                            = false -> (known after apply)
      ~ id                                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01" -> (known after apply)
      ~ minimal_tls_version                          = "Tls12" -> (known after apply)
      + mongo_server_version                         = (known after apply)
      ~ multiple_write_locations_enabled             = false -> (known after apply)
      ~ name                                         = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      - network_acl_bypass_ids                       = [] -> null
      ~ primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      ~ primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      ~ primary_readonly_sql_connection_string       = (sensitive value)
      ~ primary_sql_connection_string                = (sensitive value)
      ~ read_endpoints                               = [
          - "https://ts-p-itn-trial-account-01-italynorth.documents.azure.com:443/",
          - "https://ts-p-itn-trial-account-01-germanywestcentral.documents.azure.com:443/",
        ] -> (known after apply)
      ~ secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      ~ secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      ~ secondary_readonly_sql_connection_string     = (sensitive value)
      ~ secondary_sql_connection_string              = (sensitive value)
        tags                                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ write_endpoints                              = [
          - "https://ts-p-itn-trial-account-01-italynorth.documents.azure.com:443/",
        ] -> (known after apply)
        # (14 unchanged attributes hidden)

      - analytical_storage {
          - schema_type = "WellDefined" -> null
        }

      ~ backup {
          ~ interval_in_minutes = 0 -> (known after apply)
          ~ retention_in_hours  = 0 -> (known after apply)
          + storage_redundancy  = (known after apply)
          ~ tier                = "Continuous30Days" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ consistency_policy {
          - max_interval_in_seconds = 5 -> null
          - max_staleness_prefix    = 100 -> null
            # (1 unchanged attribute hidden)
        }

      - geo_location {
          - failover_priority = 0 -> null
          - id                = "ts-p-itn-trial-account-01-italynorth" -> null
          - location          = "italynorth" -> null
          - zone_redundant    = true -> null
        }
      - geo_location {
          - failover_priority = 1 -> null
          - id                = "ts-p-itn-trial-account-01-germanywestcentral" -> null
          - location          = "germanywestcentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "germanywestcentral"
          + zone_redundant    = false
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "a28a9d8d-2e83-4c6e-ae8f-f24bfd0ba551" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.commons.module.cosmosdb_account.azurerm_monitor_metric_alert.cosmos_db_provisioned_throughput_exceeded[0] must be replaced
-/+ resource "azurerm_monitor_metric_alert" "cosmos_db_provisioned_throughput_exceeded" {
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Insights/metricAlerts/[TS-TRIAL | ts-p-itn-trial-account-01] Provisioned Throughput Exceeded" -> (known after apply)
      ~ name                     = "[TS-TRIAL | ts-p-itn-trial-account-01] Provisioned Throughput Exceeded" -> "[TS-TRIAL | ts-p-itn-cosno-01] Provisioned Throughput Exceeded" # forces replacement
      ~ scopes                   = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01",
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
        # (7 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01" -> null
          - webhook_properties = {} -> null
        }
      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

        # (1 unchanged block hidden)
    }

  # module.commons.module.cosmosdb_account.azurerm_private_endpoint.sql[0] must be replaced
-/+ resource "azurerm_private_endpoint" "sql" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-trial-cosmosdb-account" -> (known after apply)
      ~ name                     = "ts-p-itn-trial-cosmosdb-account" -> "ts-p-itn-cosno-pep-01" # forces replacement
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-trial-cosmosdb-account.nic.17ed06ea-b9d7-4a76-8923-026d4ff3eda6"
              - name = "ts-p-itn-trial-cosmosdb-account.nic.17ed06ea-b9d7-4a76-8923-026d4ff3eda6"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-trial-cosmosdb-account/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.documents.azure.com"
              - name                = "privatelink.documents.azure.com"
              - private_dns_zone_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.4",
                        ]
                      - name         = "ts-p-itn-trial-account-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01-italynorth.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.5",
                        ]
                      - name         = "ts-p-itn-trial-account-01-italynorth"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "ts-p-itn-trial-account-01-germanywestcentral.privatelink.documents.azure.com"
                      - ip_addresses = [
                          - "10.30.2.6",
                        ]
                      - name         = "ts-p-itn-trial-account-01-germanywestcentral"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      - tags                     = {} -> null
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-trial-cosmosdb-account/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
          ~ name                           = "ts-p-itn-trial-cosmosdb-account-private-endpoint" -> "ts-p-itn-cosno-psc-pep-01" # forces replacement
          ~ private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.30.2.4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.commons.module.cosmosdb_sql_database_trial.azurerm_cosmosdb_sql_database.this must be replaced
-/+ resource "azurerm_cosmosdb_sql_database" "this" {
      ~ account_name        = "ts-p-itn-trial-account-01" -> "ts-p-itn-cosno-01" # forces replacement
      ~ id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/ts-p-itn-trial-account-01/sqlDatabases/db" -> (known after apply)
        name                = "db"
      ~ throughput          = 0 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"                            = "activations"
          - "ACTIVATION_CONSUMER"                                            = "on"
          - "ACTIVATION_MAX_FETCH_SIZE"                                      = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                = "5"
          - "ActivationConsumerCosmosDBConnection__accountEndpoint"          = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01"
          - "COSMOSDB_DATABASE_NAME"                                         = "db"
          - "COSMOSDB_ENDPOINT"                                              = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"                     = (sensitive value)
          - "EVENTHUB_NAMESPACE"                                             = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                                = "on"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                                   = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                                        = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                            = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                               = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                    = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                              = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                        = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                 = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                                       = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"                             = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
          - "NODE_ENV"                                                       = "production"
          - "SERVICEBUS_NAMESPACE"                                           = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                                           = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                                = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                                              = "ProductionTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"                   = "subscription-history"
          - "SUBSCRIPTION_ID"                                                = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"                             = "ts-p-itn-sr-evh-01"
          - "SubscriptionHistoryCosmosConnection__accountEndpoint"           = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "SubscriptionRequestEventHubConnection__fullyQualifiedNamespace" = "ts-p-itn-main-evhns-01.servicebus.windows.net"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          - "TRIAL_CONSUMER"                                                 = "on"
          - "TrialsCosmosConnection__accountEndpoint"                        = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                = "1"
          - "WEBSITE_DNS_SERVER"                                             = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                       = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01"
        name                                           = "ts-p-itn-subscription-async-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"                            = "activations"
          - "ACTIVATION_CONSUMER"                                            = "on"
          - "ACTIVATION_MAX_FETCH_SIZE"                                      = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                = "5"
          - "ActivationConsumerCosmosDBConnection__accountEndpoint"          = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "AzureFunctionsWebHost__hostid"                                  = "subscription-async-fn-01-staging"
          - "COSMOSDB_DATABASE_NAME"                                         = "db"
          - "COSMOSDB_ENDPOINT"                                              = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"                     = (sensitive value)
          - "EVENTHUB_NAMESPACE"                                             = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                                = "on"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                                   = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                                        = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                            = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                               = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                    = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                              = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                        = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                 = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                                       = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"                             = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                                 = "leases"
          - "NODE_ENV"                                                       = "production"
          - "SERVICEBUS_NAMESPACE"                                           = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                                           = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                                = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                                              = "StagingTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"                   = "subscription-history"
          - "SUBSCRIPTION_ID"                                                = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                                  = "on"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"                             = "ts-p-itn-sr-evh-01"
          - "SubscriptionHistoryCosmosConnection__accountEndpoint"           = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "SubscriptionRequestEventHubConnection__fullyQualifiedNamespace" = "ts-p-itn-main-evhns-01.servicebus.windows.net"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          - "TRIAL_CONSUMER"                                                 = "on"
          - "TrialsCosmosConnection__accountEndpoint"                        = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                = "1"
          - "WEBSITE_DNS_SERVER"                                             = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                       = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"             = "activations"
          - "ACTIVATION_CONSUMER"                             = "off"
          - "ACTIVATION_MAX_FETCH_SIZE"                       = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "COSMOSDB_DATABASE_NAME"                          = "db"
          - "COSMOSDB_ENDPOINT"                               = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EVENTHUB_NAMESPACE"                              = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                 = "off"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                    = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
          - "NODE_ENV"                                        = "production"
          - "SERVICEBUS_NAMESPACE"                            = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                            = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                 = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                               = "ProductionTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                   = "off"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"    = "subscription-history"
          - "SUBSCRIPTION_ID"                                 = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                   = "off"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"              = "ts-p-itn-sr-evh-01"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          - "TRIAL_CONSUMER"                                  = "off"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "ACTIVATIONS_COSMOSDB_CONTAINER_NAME"             = "activations"
          - "ACTIVATION_CONSUMER"                             = "off"
          - "ACTIVATION_MAX_FETCH_SIZE"                       = "999"
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5"
          - "COSMOSDB_DATABASE_NAME"                          = "db"
          - "COSMOSDB_ENDPOINT"                               = "https://ts-p-itn-trial-account-01.documents.azure.com:443/"
          - "DURABLE_FUNCTION_STORAGE_CONNECTION_STRING"      = (sensitive value)
          - "EVENTHUB_NAMESPACE"                              = "ts-p-itn-main-evhns-01"
          - "EVENTS_PRODUCER"                                 = "off"
          - "EVENTS_SERVICEBUS_TOPIC_NAME"                    = "ts-p-itn-events-sbt-01"
          - "FETCH_KEEPALIVE_ENABLED"                         = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"             = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                     = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"               = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                         = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                  = "4"
          - "FUNCTIONS_WORKER_RUNTIME"                        = "node"
          - "INTERNAL_STORAGE_CONNECTION_STRING"              = (sensitive value)
          - "LEASES_COSMOSDB_CONTAINER_NAME"                  = "leases"
          - "NODE_ENV"                                        = "production"
          - "SERVICEBUS_NAMESPACE"                            = "ts-p-itn-events-sbns-01"
          - "SERVICE_BUS_LOCATION"                            = "italynorth"
          - "SERVICE_BUS_RESOURCE_GROUP_NAME"                 = "ts-p-itn-data-rg-01"
          - "SLOT_TASK_HUBNAME"                               = "StagingTaskHub"
          - "SUBSCRIPTION_HISTORY_CONSUMER"                   = "off"
          - "SUBSCRIPTION_HISTORY_COSMOSDB_CONTAINER_NAME"    = "subscription-history"
          - "SUBSCRIPTION_ID"                                 = "a2124115-ba74-462f-832a-9192cbd03649"
          - "SUBSCRIPTION_REQUEST_CONSUMER"                   = "off"
          - "SUBSCRIPTION_REQUEST_EVENTHUB_NAME"              = "ts-p-itn-sr-evh-01"
          - "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          - "TRIAL_CONSUMER"                                  = "off"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG" = "1"
          - "WEBSITE_DNS_SERVER"                              = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                        = "1"
        } -> (known after apply)
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 18 to add, 5 to change, 18 to destroy.

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 16 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
